A622266/micropython/ports/mimxrt/machine_i2s.c
#if defined(MIMXRT117x_SERIES)
// for 1176 the pre_div value is used for post_div of the Audio PLL,
// which is 2**n: 0->1, 1->2, 2->4, 3->8, 4->16, 5->32
// The divider is 8 bit and must be given as n (not n-1)
// So the total division factor is given by (2**p) * d
static const i2s_clock_config_t clock_config_map[] = {
    {kSAI_SampleRate8KHz, &audioPllConfig_8000_48000, 1, 192},     // 384
    {kSAI_SampleRate11025Hz, &audioPllConfig_11025_44100, 1, 128}, // 256
    {kSAI_SampleRate12KHz, &audioPllConfig_8000_48000, 1, 128},    // 256
    {kSAI_SampleRate16KHz, &audioPllConfig_8000_48000, 0, 192},    // 192
    {kSAI_SampleRate22050Hz, &audioPllConfig_11025_44100, 0, 128}, // 128
    {kSAI_SampleRate24KHz, &audioPllConfig_8000_48000, 0, 128},    // 128
    {kSAI_SampleRate32KHz, &audioPllConfig_8000_48000, 0, 96},     // 96
    {kSAI_SampleRate44100Hz, &audioPllConfig_11025_44100, 0, 64},  // 64
    {kSAI_SampleRate48KHz, &audioPllConfig_8000_48000, 0, 64}      // 64
};

static const clock_root_t i2s_clock_mux[] = I2S_CLOCK_MUX;
#else
// for 10xx the total division factor is given by (p + 1) * (d + 1)
static const i2s_clock_config_t clock_config_map[] = {
    {kSAI_SampleRate8KHz, &audioPllConfig_8000_48000, 5, 63},      // 384
    {kSAI_SampleRate11025Hz, &audioPllConfig_11025_44100, 3, 63},  // 256
    {kSAI_SampleRate12KHz, &audioPllConfig_8000_48000, 3, 63},     // 256
    {kSAI_SampleRate16KHz, &audioPllConfig_8000_48000, 2, 63},     // 192
    {kSAI_SampleRate22050Hz, &audioPllConfig_11025_44100, 1, 63},  // 128
    {kSAI_SampleRate24KHz, &audioPllConfig_8000_48000, 1, 63},     // 128
    {kSAI_SampleRate32KHz, &audioPllConfig_8000_48000, 1, 47},     // 96
    {kSAI_SampleRate44100Hz, &audioPllConfig_11025_44100, 0, 63},  // 64
    {kSAI_SampleRate48KHz, &audioPllConfig_8000_48000, 0, 63},     // 64
    // 96kHz and 192kHz reuse audioPllConfig_8000_48000: its fixed PLL output
    // (786,432,000 Hz = 48000 x 64 x 256, see that config's own comment above) divides
    // evenly for these too, since they are clean binary multiples of the 48kHz family.
    // Total division factor = PLL output / (256 x rate): 32 for 96kHz, 16 for 192kHz,
    // both reachable with pre_div=0 given the (pre_div+1)*(div+1) formula this table
    // already uses (confirmed against the 48kHz/32kHz entries' own division-factor
    // comments).
    {kSAI_SampleRate96KHz, &audioPllConfig_8000_48000, 0, 31},     // 32
    {kSAI_SampleRate192KHz, &audioPllConfig_8000_48000, 0, 15}     // 16
};

static const clock_mux_t i2s_clock_mux[] = I2S_CLOCK_MUX;
static const clock_div_t i2s_clock_pre_div[] = I2S_CLOCK_PRE_DIV;
static const clock_div_t i2s_clock_div[] = I2S_CLOCK_DIV;
static const iomuxc_gpr_mode_t i2s_iomuxc_gpr_mode[] = I2S_IOMUXC_GPR_MODE;
#endif

static const I2S_Type *i2s_base_ptr[] = I2S_BASE_PTRS;

static const dma_request_source_t i2s_dma_req_src_tx[] = I2S_DMA_REQ_SRC_TX;
static const dma_request_source_t i2s_dma_req_src_rx[] = I2S_DMA_REQ_SRC_RX;
static const gpio_map_t i2s_gpio_map[] = I2S_GPIO_MAP;

// Upstream previously tracked one live I2S object per i2s_id, with TX and RX mutually
// exclusive: constructing the second direction on an id silently deinitialized -- and
// destroyed the DMA state of -- whichever direction was already there. The SAI hardware
// itself genuinely supports simultaneous TX+RX in synchronous mode (the cross-direction
// sync-mode branches in i2s_init() already configure it correctly on every construction
// call, regardless of order). Track one object per (id, direction) pair instead, so a
// second direction on the same id can coexist with the first.
#define I2S_OBJ_SLOT(i2s_id, mode) (((i2s_id) - 1) * 2 + (mode))
#define I2S_NUM_OBJ_SLOTS (MICROPY_HW_I2S_NUM * 2)

static inline machine_i2s_obj_t *i2s_peer(mp_int_t i2s_id, i2s_mode_t mode) {
    machine_i2s_obj_t *peer = MP_STATE_PORT(machine_i2s_obj)[I2S_OBJ_SLOT(i2s_id, mode == TX ? RX : TX)];
    return (peer != NULL && peer->i2s_inst != NULL) ? peer : NULL;
}

AT_NONCACHEABLE_SECTION_ALIGN(edma_tcd_t edmaTcd[I2S_NUM_OBJ_SLOTS], 32);

// called on processor reset
void machine_i2s_init0() {
    for (uint8_t i = 0; i < I2S_NUM_OBJ_SLOTS; i++) {
        MP_STATE_PORT(machine_i2s_obj)[i] = NULL;
    }
}

// called on soft reboot
void machine_i2s_deinit_all(void) {
    for (uint8_t i = 0; i < I2S_NUM_OBJ_SLOTS; i++) {
        machine_i2s_obj_t *i2s_obj = MP_STATE_PORT(machine_i2s_obj)[i];
        if (i2s_obj != NULL) {
            machine_i2s_deinit(i2s_obj);
            MP_STATE_PORT(machine_i2s_obj)[i] = NULL;
        }
    }
}

static int8_t get_frame_mapping_index(int8_t bits, format_t format) {
    if (format == MONO) {
        if (bits == 16) {
            return 0;
        } else { // 32 bits
            return 1;
        }
    } else { // STEREO
        if (bits == 16) {
            return 2;
        } else { // 32 bits
            return 3;
        }
    }
}

static int8_t get_dma_bits(uint16_t mode, int8_t bits) {
    if (mode == TX) {
        if (bits == 16) {
            return 16;
        } else {
            return 32;
        }
        return bits;
    } else { // RX
        // always read 32 bit words for I2S e.g.  I2S MEMS microphones
        return 32;
    }
}

static bool lookup_gpio(const machine_pin_obj_t *pin, i2s_pin_function_t fn, uint8_t hw_id, uint16_t *index) {
    for (uint16_t i = 0; i < ARRAY_SIZE(i2s_gpio_map); i++) {
        if ((pin->name == i2s_gpio_map[i].name) &&
            (i2s_gpio_map[i].fn == fn) &&
            (i2s_gpio_map[i].hw_id == hw_id)) {
            *index = i;
            return true;
        }
    }
    return false;
}

static bool set_iomux(const machine_pin_obj_t *pin, i2s_pin_function_t fn, uint8_t hw_id) {
    uint16_t mapping_index;
    if (lookup_gpio(pin, fn, hw_id, &mapping_index)) {
        iomux_table_t iom = i2s_gpio_map[mapping_index].iomux;
        IOMUXC_SetPinMux(iom.muxRegister, iom.muxMode, iom.inputRegister, iom.inputDaisy, iom.configRegister, 1U);
        IOMUXC_SetPinConfig(iom.muxRegister, iom.muxMode, iom.inputRegister, iom.inputDaisy, iom.configRegister,
            pin_generate_config(PIN_PULL_DISABLED, PIN_MODE_OUT, 2, iom.configRegister));
        return true;
    } else {
        return false;
    }
}

