A622266/micropython/ports/mimxrt/machine_i2s.c
    if (!set_iomux(self->sck, SCK, self->i2s_id)) {
        return false;
    }

    if (!set_iomux(self->ws, WS, self->i2s_id)) {
        return false;
    }

    if (!set_iomux(self->sd, SD, self->i2s_id)) {
        return false;
    }

    if (self->mck) {
        if (!set_iomux(self->mck, MCK, self->i2s_id)) {
            return false;
        }
        #if defined(MIMXRT117x_SERIES)
        switch (self->i2s_id) {
            case 1:
                IOMUXC_GPR->GPR0 |= IOMUXC_GPR_GPR0_SAI1_MCLK_DIR_MASK;
                break;
            case 2:
                IOMUXC_GPR->GPR1 |= IOMUXC_GPR_GPR1_SAI2_MCLK_DIR_MASK;
                break;
            case 3:
                IOMUXC_GPR->GPR2 |= IOMUXC_GPR_GPR2_SAI3_MCLK_DIR_MASK;
                break;
            case 4:
                IOMUXC_GPR->GPR2 |= IOMUXC_GPR_GPR2_SAI4_MCLK_DIR_MASK;
                break;
        }
        #else
        IOMUXC_EnableMode(IOMUXC_GPR, i2s_iomuxc_gpr_mode[self->i2s_id], true);
        #endif
    }

    // If the opposite direction is already live on this id, we must not disturb its
    // running DMA/FIFO state: skip the whole-peripheral SAI_Init() below, and skip
    // re-configuring (and thereby resetting) the peer's own direction in the
    // cross-mode branches further down. If a *same*-direction object is being replaced
    // (e.g. re-running I2S(1, mode=TX, ...) while an old TX is still registered), deinit
    // it first, same as the original behavior -- but scoped to just that direction, not
    // the whole peripheral, if a peer exists.
    machine_i2s_obj_t *peer = i2s_peer(self->i2s_id, self->mode);
    uint8_t my_slot = I2S_OBJ_SLOT(self->i2s_id, self->mode);
    machine_i2s_obj_t *existing_same_direction = MP_STATE_PORT(machine_i2s_obj)[my_slot];
    if (existing_same_direction != NULL && existing_same_direction != self) {
        machine_i2s_deinit(MP_OBJ_FROM_PTR(existing_same_direction));
    }
    self->edmaTcd = &edmaTcd[my_slot];
    MP_STATE_PORT(machine_i2s_obj)[my_slot] = self;

    self->dma_channel = allocate_dma_channel();

    DMAMUX_Init(DMAMUX);
    if (self->mode == TX) {
        DMAMUX_SetSource(DMAMUX, self->dma_channel, i2s_dma_req_src_tx[self->i2s_id]);
    } else { // RX
        DMAMUX_SetSource(DMAMUX, self->dma_channel, i2s_dma_req_src_rx[self->i2s_id]);
    }
    DMAMUX_EnableChannel(DMAMUX, self->dma_channel);

    dma_init();
    EDMA_CreateHandle(&self->edmaHandle, DMA0, self->dma_channel);
    EDMA_SetCallback(&self->edmaHandle, edma_i2s_callback, self);
    EDMA_ResetChannel(DMA0, self->dma_channel);

    // SAI_Init() unconditionally clears both TCSR and RCSR's DMA-request-enable bits --
    // fatal to an already-running peer's DMA feed. Only the first direction on this id
    // needs to bring the peripheral up at all.
    if (peer == NULL) {
        SAI_Init(self->i2s_inst);
    }

    sai_transceiver_t saiConfig;
    // SAI_GetTDMConfig() is the SDK's own convenience initializer for TDM framing
    // (fsl_sai.h), directly analogous to SAI_GetClassicI2SConfig() used for
    // MONO/STEREO. kSAI_FrameSyncLenOneBitClk matches what TDM slave devices expect: a
    // frame sync pulse one BCLK cycle wide at the start of the frame, not classic I2S's
    // 50%-duty toggle.
    if (self->format == TDM) {
        SAI_GetTDMConfig(&saiConfig, kSAI_FrameSyncLenOneBitClk, get_dma_bits(self->mode, self->bits),
            self->num_slots, kSAI_Channel0Mask);
    } else {
        SAI_GetClassicI2SConfig(&saiConfig, get_dma_bits(self->mode, self->bits), kSAI_Stereo, kSAI_Channel0Mask);
    }
    saiConfig.masterSlave = kSAI_Master;

    uint16_t sck_index;
    lookup_gpio(self->sck, SCK, self->i2s_id, &sck_index);

    if ((self->mode == TX) && (i2s_gpio_map[sck_index].mode == TX)) {
        saiConfig.syncMode = kSAI_ModeAsync;
        SAI_TxSetConfig(self->i2s_inst, &saiConfig);
    } else if ((self->mode == RX) && (i2s_gpio_map[sck_index].mode == RX)) {
        saiConfig.syncMode = kSAI_ModeAsync;
        SAI_RxSetConfig(self->i2s_inst, &saiConfig);
    } else if ((self->mode == TX) && (i2s_gpio_map[sck_index].mode == RX)) {
        // Only touch RX's own registers here if RX isn't already an active peer --
        // SAI_RxSetConfig starts with a full destructive SAI_RxReset.
        if (peer == NULL) {
            saiConfig.syncMode = kSAI_ModeAsync;
            SAI_RxSetConfig(self->i2s_inst, &saiConfig);
        }
        saiConfig.bitClock.bclkSrcSwap = true;
        saiConfig.syncMode = kSAI_ModeSync;
        SAI_TxSetConfig(self->i2s_inst, &saiConfig);
    } else if ((self->mode == RX) && (i2s_gpio_map[sck_index].mode == TX)) {
        // Mirror of the above -- don't reset an active TX peer.
        if (peer == NULL) {
            saiConfig.syncMode = kSAI_ModeAsync;
            SAI_TxSetConfig(self->i2s_inst, &saiConfig);
        }
        saiConfig.syncMode = kSAI_ModeSync;
        SAI_RxSetConfig(self->i2s_inst, &saiConfig);
    } else {
        return false; // should never happen
    }

    // Channel count used for BCLK-rate computation must match the actual slot count
    // (2/4/8/16) for TDM, not always 2. See i2s_num_channels() above.
    SAI_TxSetBitClockRate(self->i2s_inst, clock_freq, self->rate, get_dma_bits(self->mode, self->bits),
        i2s_num_channels(self));
    SAI_RxSetBitClockRate(self->i2s_inst, clock_freq, self->rate, get_dma_bits(self->mode, self->bits),
        i2s_num_channels(self));

    edma_transfer_config_t transferConfig;
    uint8_t bytes_per_sample = get_dma_bits(self->mode, self->bits) / 8;

    if (self->mode == TX) {
        uint32_t destAddr = SAI_TxGetDataRegisterAddress(self->i2s_inst, SAI_CHANNEL_0);
        EDMA_PrepareTransfer(&transferConfig,
            self->dma_buffer_dcache_aligned, bytes_per_sample,
            (void *)destAddr, bytes_per_sample,
            (FSL_FEATURE_SAI_FIFO_COUNTn(self->i2s_inst) - saiConfig.fifo.fifoWatermark) * bytes_per_sample,
            SIZEOF_DMA_BUFFER_IN_BYTES, kEDMA_MemoryToPeripheral);
    } else { // RX
        uint32_t srcAddr = SAI_RxGetDataRegisterAddress(self->i2s_inst, SAI_CHANNEL_0);
        EDMA_PrepareTransfer(&transferConfig,
            (void *)srcAddr, bytes_per_sample,
            self->dma_buffer_dcache_aligned, bytes_per_sample,
            (FSL_FEATURE_SAI_FIFO_COUNTn(self->i2s_inst) - saiConfig.fifo.fifoWatermark) * bytes_per_sample,
            SIZEOF_DMA_BUFFER_IN_BYTES, kEDMA_PeripheralToMemory);
    }

    memset(self->edmaTcd, 0, sizeof(edma_tcd_t));

    // continuous DMA operation is achieved using the scatter/gather feature, with one TCD linked back to itself
    EDMA_TcdSetTransferConfig(self->edmaTcd, &transferConfig, self->edmaTcd);
    EDMA_TcdEnableInterrupts(self->edmaTcd, kEDMA_MajorInterruptEnable | kEDMA_HalfInterruptEnable);
    EDMA_InstallTCD(DMA0, self->dma_channel, self->edmaTcd);
    EDMA_StartTransfer(&self->edmaHandle);

    if (self->mode == TX) {
        SAI_TxEnableDMA(self->i2s_inst, kSAI_FIFORequestDMAEnable, true);
        SAI_TxEnable(self->i2s_inst, true);
        SAI_TxSetChannelFIFOMask(self->i2s_inst, kSAI_Channel0Mask);
    } else { // RX
        SAI_RxEnableDMA(self->i2s_inst, kSAI_FIFORequestDMAEnable, true);
        SAI_RxEnable(self->i2s_inst, true);
        SAI_RxSetChannelFIFOMask(self->i2s_inst, kSAI_Channel0Mask);
    }

